app/views/payments/_form.html.erb

      <%= f.label :group %>
      <%= f.collection_select :group_id, Group.all, :id, :name, {prompt: 'Select group'}, class:'form-control' %>
---
SELECT "groups".* FROM "groups"