app/controllers/groups_controller.rb

  def index
    @groups = Group.includes(:user).paginate(page: params[:page], per_page: 2).order(:name)
---
SELECT "groups".* FROM "groups" ORDER BY "groups"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]

  def show
    @group = Group.find(params[:id])
    @group_payments = @group.payments.paginate(page: params[:page], per_page: 2).order('created_at DESC')
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "payments".* FROM "payments" INNER JOIN "payments_groups" ON "payments"."id" = "payments_groups"."payment_id" WHERE "payments_groups"."group_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["group_id", 1], ["LIMIT", 2], ["OFFSET", 0]]

  def create
    @group = current_user.groups.build(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "icon", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Academics"], ["icon", "killkwveuq6spgaq4sb2.png"], ["created_at", "2021-03-24 21:00:15.909138"], ["updated_at", "2021-03-24 21:00:15.909138"], ["user_id", 1]]

  def set_group
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]