app/controllers/groups_controller.rb

  def update
    if @group.update(group_params)
---
UPDATE "groups" SET "icon" = $1 WHERE "groups"."id" = $2  [["icon", "image/upload/v1616619620/killkwveuq6spgaq4sb2.png"], ["id", 1]]