app/controllers/payments_controller.rb

  def index
    # rubocop:disable Layout/HashAlignment
    @payments = Payment.includes(:groups).paginate(page: params[:page],
                    per_page: 2).where(user_id: current_user.id).joins(:groups)
    # rubocop:enable Layout/HashAlignment
    @payment_sum = Payment.where(user_id: current_user.id).joins(:groups).sum(:amount)
---
SELECT COUNT(*) FROM (SELECT DISTINCT "payments"."id" FROM "payments" INNER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" INNER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1) subquery_for_count  [["user_id", 1]]
SELECT DISTINCT "payments"."id" FROM "payments" INNER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" INNER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT SUM("payments"."amount") FROM "payments" INNER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" INNER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1  [["user_id", 1]]

  def create
    @payment = current_user.payments.build(payment_params)
    if @payment.save
      group_id = params[:payment][:group_id]
      PaymentsGroup.create(group_id: group_id, payment_id: @payment.id) if group_id
---
INSERT INTO "payments" ("name", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tuition"], ["amount", 10000], ["user_id", 1], ["created_at", "2021-03-17 20:26:39.511850"], ["updated_at", "2021-03-17 20:26:39.511850"]]
INSERT INTO "payments_groups" ("group_id", "payment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 1], ["payment_id", 6], ["created_at", "2021-03-24 21:00:49.199435"], ["updated_at", "2021-03-24 21:00:49.199435"]]

  def edit
    @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def external_payment
    # rubocop:disable Layout/HashAlignment
    @external_payments = Payment.includes(:groups).paginate(page: params[:page],
    per_page: 2).where(user_id: current_user.id).left_outer_joins(:groups).where('groups.id IS NULL')
    # rubocop:enable Layout/HashAlignment
    @exp_sum = Payment.where(user_id: current_user.id).left_outer_joins(:groups).where('groups.id IS NULL').sum(:amount)
---
SELECT "payments".* FROM "payments" LEFT OUTER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1 AND (groups.id IS NULL) LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "payments" LEFT OUTER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1 AND (groups.id IS NULL)  [["user_id", 1]]
SELECT SUM("payments"."amount") FROM "payments" LEFT OUTER JOIN "payments_groups" ON "payments_groups"."payment_id" = "payments"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "payments_groups"."group_id" WHERE "payments"."user_id" = $1 AND (groups.id IS NULL)  [["user_id", 1]]

  def set_payment
    @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]